profiling_results/stage-2_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.354ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.584ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.14ms    2.24ms  40.54ms   94.14%
    Req/Sec   532.29    144.48     1.60k    80.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.67ms
 75.000%    2.27ms
 90.000%    3.25ms
 99.000%   11.11ms
 99.900%   29.53ms
 99.990%   37.28ms
 99.999%   40.58ms
100.000%   40.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.273     0.000000            1         0.00
       0.914     0.100000         5011 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.121     0.200000        10024         0.00
       1.297     0.300000        14991        -0.00
       1.477     0.400000        20019        -0.00
       1.669     0.500000        25008         0.00
       1.768     0.550000        27488 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.874     0.600000        29998         0.00
       1.988     0.650000        32481        -0.00
       2.113     0.700000        35002        -0.00
       2.265     0.750000        37483         0.00
       2.355     0.775000        38739 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.459     0.800000        39976         0.00
       2.585     0.825000        41228        -0.00
       2.735     0.850000        42479        -0.00
       2.945     0.875000        43727         0.00
       3.083     0.887500        44354 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.253     0.900000        44975         0.00
       3.461     0.912500        45599        -0.00
       3.755     0.925000        46223        -0.00
       4.187     0.937500        46851         0.00
       4.491     0.943750        47162 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.791     0.950000        47474         -nan
       5.155     0.956250        47786        -0.00
       5.651     0.962500        48100        -0.00
       6.335     0.968750        48409         0.00
       6.783     0.971875        48565 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       7.375     0.975000        48722         -nan
       8.067     0.978125        48877        -0.00
       8.783     0.981250        49034        -0.00
       9.511     0.984375        49191         0.00
       9.959     0.985938        49269 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      10.343     0.987500        49349         0.00
      10.767     0.989062        49424        -0.00
      11.615     0.990625        49502        -0.00
      12.815     0.992188        49580         0.00
      13.527     0.992969        49619 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      14.511     0.993750        49658         0.00
      15.863     0.994531        49697        -0.00
      17.215     0.995313        49736        -0.00
      19.247     0.996094        49775         0.00
      20.095     0.996484        49796 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      21.071     0.996875        49814         -nan
      21.791     0.997266        49834        -0.00
      23.423     0.997656        49853        -0.00
      25.103     0.998047        49874         0.00
      25.663     0.998242        49883 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      26.287     0.998437        49893         -nan
      26.959     0.998633        49902        -0.00
      28.495     0.998828        49912        -0.00
      29.631     0.999023        49922         0.00
      30.111     0.999121        49927 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      30.335     0.999219        49931         0.00
      30.767     0.999316        49936        -0.00
      31.775     0.999414        49941        -0.00
      32.831     0.999512        49946         0.00
      33.311     0.999561        49949 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      33.631     0.999609        49951         0.00
      33.695     0.999658        49953        -0.00
      34.079     0.999707        49956        -0.00
      34.431     0.999756        49958         0.00
      35.071     0.999780        49961 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      35.071     0.999805        49961         -nan
      35.263     0.999829        49962        -0.00
      35.807     0.999854        49963        -0.00
      36.543     0.999878        49964         0.00
      37.279     0.999890        49965 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      37.343     0.999902        49966         -nan
      37.343     0.999915        49966        -0.00
      38.047     0.999927        49967        -0.00
      38.047     0.999939        49967         0.00
      38.591     0.999945        49968 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      38.591     0.999951        49968         0.00
      38.591     0.999957        49968        -0.00
      40.511     0.999963        49969        -0.00
      40.511     0.999969        49969         0.00
      40.511     0.999973        49969 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      40.511     0.999976        49969         0.00
      40.511     0.999979        49969        -0.00
      40.575     0.999982        49970        -0.00
      40.575     1.000000        49970         0.00
#[Mean    =        2.136, StdDeviation   =        2.239]
#[Max     =       40.544, Total count    =        49970]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59987 requests in 1.00m, 3.83MB read
Requests/sec:    999.82
Transfer/sec:     65.42KB